app/controllers/tokimons_controller.rb

SELECT "tokimons".* FROM "tokimons"
---
  def index
    @tokimons = Tokimon.all

INSERT INTO "tokimons" ("tname", "trainer_id", "weight", "height", "flyl", "fightl", "waterl", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"  [["tname", "2"], ["trainer_id", 1], ["weight", 2], ["height", 3], ["flyl", 10], ["fightl", 3], ["waterl", 3], ["created_at", 2016-10-10 06:42:29 UTC], ["updated_at", 2016-10-10 06:42:29 UTC]]
---
  def create
    @tokimon = Tokimon.new(tokimon_params)

    respond_to do |format|
      if @tokimon.save

UPDATE "tokimons" SET "flyl" = $1, "fightl" = $2, "waterl" = $3, "electricl" = $4, "freezel" = $5, "updated_at" = $6 WHERE "tokimons"."id" = $7  [["flyl", 10], ["fightl", 13], ["waterl", 14], ["electricl", 14], ["freezel", 14], ["updated_at", 2016-10-10 05:11:04 UTC], ["id", 1]]
UPDATE "trainers" SET "tokimon_id" = $1, "level" = $2, "updated_at" = $3 WHERE "trainers"."id" = $4  [["tokimon_id", 4], ["level", 1], ["updated_at", 2016-10-15 00:42:10 UTC], ["id", 3]]
---
  def update
    respond_to do |format|
      if @tokimon.update(tokimon_params)
        @tokimon.trainer.update_tokimons

DELETE FROM "tokimons" WHERE "tokimons"."id" = $1  [["id", 4]]
---
  def destroy
    @tokimon.destroy

SELECT  "tokimons".* FROM "tokimons" WHERE "tokimons"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
    def set_tokimon
      @tokimon = Tokimon.find(params[:id])