app/controllers/trainers_controller.rb

SELECT "trainers".* FROM "trainers"
---
  def index
    @trainers = Trainer.all

INSERT INTO "trainers" ("name", "level", "tokimon_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Afke"], ["level", 1], ["tokimon_id", 1], ["created_at", 2016-10-10 02:25:33 UTC], ["updated_at", 2016-10-10 02:25:33 UTC]]
---
  def create
    @trainer = Trainer.new(trainer_params)

    respond_to do |format|
      if @trainer.save

DELETE FROM "trainers" WHERE "trainers"."id" = $1  [["id", 2]]
---
  def destroy
    @trainer.destroy

SELECT  "trainers".* FROM "trainers" WHERE "trainers"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def set_trainer
      @trainer = Trainer.find(params[:id])