app/views/tokimons/_form.html.erb

SELECT "trainers".* FROM "trainers"
---
    <%= f.label :trainer_id %>
    <%= f.collection_select( :trainer_id , Trainer.all, :id, :name) %>