app/views/trainers/show.html.erb

SELECT "tokimons".* FROM "tokimons" WHERE "tokimons"."trainer_id" = $1  [["trainer_id", 1]]
---
  <tbody>
    <% Tokimon.all.where(trainer_id: @trainer.id).each do |tokimon| %>